        IDENTIFICATION DIVISION. 
        PROGRAM-ID. ENRCYPT.
        DATA DIVISION.
        WORKING-STORAGE SECTION. 
             
        
        01 PRINT LINE.
        05 FILLER PIC X(10) VALUE SPACES.
        05 FILLER PIC X(15) VALUE "9832764".
        05 FILLER PIC X(20) VALUE SPACES.
        05 FILLER PIC X(5) VALUE "KEY".
        05 page-number PIC ZZZ9.
        
        
        PROCEDURE DIVISION.
        
        
        
        END PROGRAM ENRCYPT.
