IDENTIFICATION DIVISION. 
PROGRAM-ID. FILLER.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-PC.
OBJECT-COMPUTER. IBM-PC.
DATA DIVISION.
WORKING-STORAGE SECTION. 


01 OUT-REC.
   05 DATA-A PIC X(10).
   05 DATA-B PIC X(15).
   05 DATA-C PIC X(20).
   05 FILLER PIC X(25).
   05 FILLER REDEFINES FILLER.
   10 DATA-D PIC X(10).
   10 FILLER PIC X(15).git@gitlab.com:4math2379/vault_aws.git
   
END PROGRAMM FILLER.
```