       IDENTIFICATION DIVISION.
       PROGRAM-ID. MECCG.
       AUTHOR. SINIEN R.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.
       OBJECT-COMPUTER. IBM-PC.


       